Repository: GamemakerChina/GMS2_manual_en2ch
Catalog: omegat/project_save.tmx
Source language: en_us
Languages: zh_cn

source: Well for that we have to manually type each and every position ourselves, but there is a nice trick to help us keep track of things there too!
zh_cn: 好吧，我们必须自己手动输入每个位置，但是也有一个很好的技巧可以帮助我们跟踪那里的东西！

source: Well let's look at a very simple example 1+1.
zh_cn: 那么让我们来看看一个非常简单的示例 1 + 1。

source: Well let's take a look:
zh_cn: 我们来看一下：

source: Well pretty easily it turns out:
zh_cn: 结论是很容易做到：

source: Well this is where the binary AND operation comes in.
zh_cn: 这里就该让位与（位且，Binary AND）运算符登场了。

source: Well, an array has to be initialized before we can use it or GameMaker Studio 2 will give us an error.
zh_cn: 好吧，在我们使用它之前必须先将数组初始化</ i0>，否则 GameMaker Studio 2 </ i1>将给出一个错误。

source: Well, as bit 5 is 32, then all the bits below would be 31, and that's the maximum remainder so that's what we AND with (we could also use ((1<<5)-1) which would make 32-1 = 31.
zh_cn: 因为 5 号位是 32，其下所有的位就是 31，这也是可能的最大余数，因此这就是我们使用位与运算的物体（我们也可以这样用 ((1<<5)-1），会使得 32 - 1 = 31

source: Well, here are just a few things that would be impossible without arrays -
zh_cn: 有些东西不用数组实现不了——

source: Well, here's a neat little trick..
zh_cn: 这里有个小技巧...

source: Well, if we use proper power-of-2 tiles, then we have a very simple method that's also lightning fast.
zh_cn: 如果我们使用了合适的 2 次方图块，那么我们就有一个非常简单、快速的方法。

source: Well, in order to divide by 32, we have to execute a floating point divide – which obviously takes time, but in order to do the mod 32, you actually have to do another one!
zh_cn: 为了除以32，我们必须执行一次浮点除法——显然，这很花费时间，但是为了和对 32 取余数，你实际上还需要再做一次！

source: Well, it merges all the bits together into a single value, like this:
zh_cn: 事实上，它将所有的位融合在一起，成为一个单独的值，像这样：

source: Well, let's say you want to store a true or false as a value.
zh_cn: 嗯，你想将 真 或者 假作为一个值储存。

source: Well, normally you wouldn't, but if you wish to have more than one version of your game running at a time it can be done using this, making A/B comparative tests far easier.
zh_cn: 通常情况下并不需要这样做，但是如果你想同时运行游戏的多个版本，你就可以使用这个命令行参数，使得 A/B 比较测试更加容易

source: Well, normally you'd just assign an ID to the key and the door.
zh_cn: 通常你只需要给钥匙和门分配一个ID。

source: Well, quite clearly 4 is.
zh_cn: 显然是4啦。

source: Well, something like this...
zh_cn: emmm……就像这样……

source: Well, that's made from 128+64+4 or 11000100.
zh_cn: 好的， 由 128 + 64 + 4 或者说 11000100 构成。

source: Well, we get this... 110011 & 110010, which obviously leaves us with FALSE, as there are lots of "bits" left after the AND.
zh_cn: 我们将会得到...110011 & 110010，结果显然是 FALSE，因为与运算后还有很多位。

source: Well, when an object has a parent assigned it can share code, actions and events with that parent.
zh_cn: 那么当一个对象分配了一个父类时，它可以与该父进程共享代码，动作和事件。

source: What Is A Buffer?
zh_cn: 什么是缓冲区？

source: What Is A Vector?
zh_cn: 什么是向量?

source: What about clearing flags?
zh_cn: 那么，清除标记呢？

source: What are you looking for?
zh_cn: 您想找什么？

source: What arguments you provide to this function will depend on the effect you wish it to have on the GUI layer.
zh_cn: 函数提供什么参数，决定于想要在GUI层表达什么样的效果。

source: What does it look like?
zh_cn: 它长啥样呢？

source: What does that mean?
zh_cn: 为什么这样做呢？

source: What if you wanted to check to see if something was a power of 2?
zh_cn: 如果你想检查某个数是否为 2 的次方数呢？

source: What is the default toolbox location?
zh_cn: 默认的工具栏位置是？

source: What this does, is first time through is 0 ^ 1 = 1, then the second time 1 ^ 1 = 0, thereby toggling things back and forth from 0 to 1.
zh_cn: 这样做，第一次的时候（a = 0）是 0 ^ 1 = 1，然后第二次（a = 1）是1 ^ 1 = 0，从而触发从 0 到 1 再到 0 的来回。

source: What this means is that the order in which you place functions in your code will change from platform to platform, so you should code them in an explicit manner.
zh_cn: 这也就意味着在你的代码中函数的顺序会依照平台的不同而发生变化，因此你需要以一种显式的方式来进行编写。

source: What this means is that you can "pick and choose" which compiler version and which runner version to use should you have found any issues with the current one or are aiming at a very specific target version or platform.
zh_cn: 而这就意味着当你发现当前的编译器和运行器对某一个目标版本或平台有问题的时候，你可以“挑选”编译器和运行器的版本。

source: What this means, is that just as you are able to set multiple flags at once, you can also clear multiple flags at once.
zh_cn: 这意味着什么呢，那就是你能够一次性 设置 多个标志（flag），也可以一次性 清除 多个标志。

source: What we need is a way to flip bits easily (and preferably without CPU cost).
zh_cn: 我们需要的是一种比较容易翻转“位”的方法（最好没有 CPU 开销）。

source: When a Remote Worker has been configured, you will then be able to select it from the list here, and have it build your projects rather than use the host machine where GameMaker Studio 2 is installed.
zh_cn: 当配置了远程工作机器后，您将能够从列表中选择 它 ，并使用其来构建项目，而不只是使用安装了 GameMaker Studio 2 的主机。

source: When an error occurs during the compiling and execution of a project this is reported with a message in the Compile Errors Output Window, much like the one shown below:
zh_cn: 当在编译和执行项目时发生错误，会在 编译错误输出窗口 中显示一条消息，如下所示：

source: When creating games it is important that you play test the executable file to make sure that the final compile is correct and has no unforeseen errors or differences.
zh_cn: 在制作游戏时，测试可执行文件是十分重要的，这可以确保最终的编译时正确的，没有意料之外的错误或差异。

source: When creating your game it's very easy to forget to declare a variable or mis-type a string as a real etc...
zh_cn: 创建游戏时，一个常见错误是忘记定义变量，或者将变量错误定义（例如将字符串变量定义为实数变量等等……）

source: When does the overview appear next to a node?
zh_cn: 这个概述什么时候出现在节点旁边？

source: When doing this, you drag the window to the area you want to dock to and it will be highlighted to show that you can dock the window there:
zh_cn: 当您执行上述操做时，您需要将窗口拖动到想要要停靠的区域，当其突出显示时即表明可以将窗口停靠在那里：

source: When getting started configurations may not be that important, but as the complexity and number of projected target platforms grows you'll find that they are an invaluable tool in organising and exporting your games correctly.
zh_cn: 刚入门时配置可能不是那么重要，但是随着预计目标平台的复杂性和数量的增加，您会发现它们是组织和导出您游戏的宝贵工具。

source: When laptop mode is on, Left and Left are "reserved" for mouse interactions like panning the room editor, where Left is zoom, Left is scroll and pan.
zh_cn: 当笔记本模式启动时，左和左是“预留”给像在房间编辑器中平移的这种鼠标操作的，而左是给缩放的，左是给滚动和平移的。

source: When laptop mode is on, Left / and Left are "reserved" for mouse interactions like panning the room editor, where Left / is zoom, Left is scroll and pan.
zh_cn: 当笔记本模式打开时， 左 / 和 左 被 “保留” 用于鼠标交互，比如平移房间编辑器，其中 左 / 控制缩放, 左 控制滚动和平移。

source: When making games, it is often necessary to store information about the game state in a file of some type, but storing this information on the device is not always the best option as, if the player deleted the game and then re-installs, this information may be lost.
zh_cn: 在游戏开发过程中，常常需要将游戏的状态信息保存在特定类型的文件中，但是把这些信息保存在本地设备上在大多数时候并不是一个好的选择，因为当玩家在卸载游戏之后重新安装时，这些数据可能会丢失。

source: When navigating the different sections of the Start Page, clicking on this will simply take you back to the main page.
zh_cn: 当你导航至起始页的不同页面，点击将带你回到主页。

source: When programming your game using GML you should be aware that function call arguments are not guaranteed an evaluation order.
zh_cn: 在使用GML编写游戏的时候，你会注意到函数调用参数的顺序并非固定的。

source: When programming your game, whether using code or Drag and Drop, it can be very easy to make mistakes - using the wrong variables, passing the wrong arguments, or using the wrong functions are just some of the most common errors we all make - and these mistakes are not always detected by the syntax checker that is included with the script/action editor.
zh_cn: 游戏的编程阶段，无论是使用代码还是拖放模块，都非常容易犯错误 - 使用错误的变量，传递错误的参数或使用错误的函数是我们所犯的一些最常见的错误 - 脚本/动作编辑器附带的语法检查器并不能没有遗漏地检测到这些错误。

source: When removing events, you can use + to select multiple events and then delete them all together.
zh_cn: 删除事件时，可以使用 + 选择多个事件，然后将它们全部删除。

source: When running a game for debugging, you can also see how your game performs and get an overview of how everything is working together by using the Profile option in the Debug Module.
zh_cn: 当运行游戏进行调试时，您还可以通过使用 调试模块 中的 配置 选项来了解游戏的运行情况，并了解所有部件是否运行一致。

source: When set to true (and you have vSync active) an alternative method will be used to that which is the default, with the aim to reduce any possible visual lag or stuttering of your game.
zh_cn: 当设置为 true （并且激活了垂直同步）时，替代方法将被使用，取代默认的方法，以减少任何可能的视觉延迟。

source: When the day is up, if your game is either in the background or not running, a notification will be shown to the user with the given title and message (on iOS, the game name is shown and the title is ignored), and then an asynchronous Push Notification Event will be called.
zh_cn: 一天以后，无论你的程序是在后台还是未启动状态，玩家都将收到之前设置的通知（在iOS平台标题被游戏的名字替代了），然后一个异步的推送通知事件（Push Notification Event）会被触发。

source: When the game is paused, you can then use the next three buttons for "stepping" through your code.
zh_cn: 当游戏暂停的时候，你可以之后使用下面三个按钮来“逐步”运行你的代码。

source: When the operating system delivers a local or remote push notification and the target application is not running in the foreground, it presents the notification to the user in the form of a banner.
zh_cn: 当操作系统推送了一个本地或远程的通知而目标程序并没有在前台运行时，通知将会以banner(横幅) 的形式来展示。

source: When this option is checked, and you have specified the argument types in the script, then they will be shown in the status bar at the bottom of the editor, enclosed in {}.
zh_cn: 当该选项被勾选并且你在脚本中标注了参数类型的时候，它们会被显示在状态栏当中，并被花括号括起来。

source: When unchecked, instances of this object will still be processed, but will not be drawn
zh_cn: 取消选中时，仍将处理此物体的实例，但不会绘制

source: When using any project view other than the default one, you can drag and drop resources wherever you wish and rename folders to be anything you wish too.
zh_cn: 当使用除默认项目视图之外的任何项目视图时，您可以随意拖放资源，并将文件夹重命名为任何您希望的内容。

source: When using the Block Pattern option, this sets the first colour for alternate blocks.
zh_cn: 当使用方块图案选项时，该颜色被设置为交替方块的第一种颜色。

source: When working on mobile devices (in particular Android devices) this is an important factor to take into consideration as what may be appropriate for one display resolution, may not be appropriate for another.
zh_cn: 在移动设备上运行时（尤其是安卓设备），这是一个重要的考量，适合这个显示器的分辨率时，可能不适合另外一个。

source: When working with objects in the GameMaker Studio 2 IDE, you can set up Parent / Child hierarchies.
zh_cn: 使用 GameMaker Studio 2 IDE中的对象时，可以设置父/子层次结构。

source: When working with the resource tree, you can use the right mouse button on any resource or folder to open a menu of options: The options available to you are:
zh_cn: 使用资源树时，可以在资源或文件夹上点击鼠标右键 打开选项菜单 ：您可以使用的选项有：

source: When writing code and this is enabled, the IDE will automatically add the two brackets () that a function requires, placing the cursor within them if the function takes arguments, or placing the cursor after them if it does not.
zh_cn: 当你写代码并且这个开启时，IDE将自动添加函数需要的两个括号()，如果函数有参数将会光标将会放置在括号内，如果没有参数，光标将会放在后面。

source: When writing code and this is enabled, you will get a popup window showing possible functions that you can use based on the current input text.
zh_cn: 当代码并且启用时，你将看到一个弹出窗口，显示基于你输入文本的可能的函数。

source: When you AND something you the bits that are set in the mask are kept, while the bits that are clear in the mask, are removed - like this:
zh_cn: 当你 “与” 一些东西，掩码中设置的位将保留，掩码中清除的位将删除 - 如下：

source: When you are watching a variable in any of the windows, it can be one of multiple data-types.
zh_cn: 当你观察任何窗口中的变量时，它都可能是数种数据类型中的任意一个。

source: When you are working with surfaces, you should always use this function whenever you are finished using them.
zh_cn: 当你用到表面图层时，不论是否结束使用，你应该一直使用这个函数。

source: When you check the Uses Physics box you are telling GameMaker Studio 2 that this object should be part of a physics world.
zh_cn: 当您检查使用物理框时，您告诉 GameMaker Studio 2 </ i1>该对象应该是物理世界</ a2>的一部分。

source: When you check this, the object resource window opens a new chained window for the physics editor: Before you start to edit the values for the physics behaviours it's a good idea to first set the collision shape.
zh_cn: 当您检查这个时，对象资源窗口打开一个新的物理编辑器的链接窗口：在开始编辑物理行为的值之前，首先设置碰撞形状 。

source: When you click on the Tutorials or Demos buttons, you will be taken to a screen which shows the tutorials/demos that you own and the Official tutorials/demos that are available for downloading:
zh_cn: 当你在开始页面点击 教程（Tutorials） 或演示项目（Demos） 按钮时会跳转到显示教程和演示项目的页面。显示你拥有的以及可供下载的官方教程演示:

source: When you click the Create Executable button you will be prompted to tell GameMaker Studio 2 which type of package you would like to create (can be either for ARM, x64 or x86 architectures), and you should choose that which targets the devices your game will be supported on: If you check the box marked Package For Store Upload, then the final package created will be an .appxupload file, which is what Microsoft specifies should be used for submitting apps to their store, as explained in this article here.
zh_cn: 当您单击“创建可执行文件”按钮时，系统将提示您告知 GameMaker Studio 2 要创建哪个类型的软件包（可用于 ARM，x64 或 x86 架构），您应该选择设备类型以使您的游戏支持相应的设备： 在 UWP 编译选项种如果您选中标记为商店上传包 的框，那么创建的最终包将是一个 .appxupload 文件，如本文中所述，这是微软指定应用于将应用程序提交到其商店的文件格式，你可以点击 这里 提交。

source: When you create a new project from the Start Page, your resource tree will only contain empty folders for the resources you may need, so you need to right-click on the sprite resource folder and then select the option Create.
zh_cn: 当您从 开始页面 创建一个新项目时，资源树将只包含您可能需要的资源的空文件夹，因此您需要右键单击 right-click 精灵资源文件夹，然后选择 创建 选项。

source: When you create a variable it can be used to hold information, and when you call a GML function, it can also return information.
zh_cn: 当你创建一个变量的时候，变量会被用于承载某种信息，还有当你调用一个GML函数的时候，它也会返回一些信息。

source: When you do that, a new window will open requesting that you input the following information:
zh_cn: 当你这样做的时候，一个新窗口会打开并要求你输入如下信息：

source: When you do, the Debug Module will open along with your game.
zh_cn: 当您这样操做时，调试模块 将随您的游戏一起打开。

source: When you first create a new object resource, there is a check-box marked Uses Physics, which is not checked by default.
zh_cn: 当您首次创建新对象资源时，会有一个标记为使用物理的复选框，默认情况下不会检查。

source: When you first create a room in your resource tree you will be presented with a new window with which to edit its properties, something like this:
zh_cn: 当你第一次在你的资源树中创建一个房间时，你将会看到一个新的窗口，用来编辑它的属性，如下所示：

source: When you first import a GameMaker Studio 2 project you will be shown a compatibility report much like this one:
zh_cn: 每当你第一次导入一个GameMaker Studio 2项目，就会有一个大致像这样的兼容性报告出现在您的面前：

source: When you first open GameMaker Studio 2, you will be asked to log in to your YoYo Account (or register for one if you haven't already - see here).
zh_cn: 第一次打开 GameMaker Studio 2，你将被要求登录你的 YoYo 帐户（如果你没有就注册一个 - 参见这里）。

source: When you first start GameMaker Studio 2, your workspace will already be populated by a couple of windows which will be "docked" to the IDE.
zh_cn: 当您第一次启动 GameMaker Studio 2 时，您的工作区将被几个“停靠”到 IDE 的窗口填充。

source: When you flag an instance as being solid, you are telling GameMaker Studio 2 that it should try to resolve any collisions before triggering a collision event.
zh_cn: 当您将实例标记为稳固时，您会告诉 GameMaker Studio 2 </ i0>，它应该尝试在触发碰撞事件之前解决任何冲突。

source: When you go to add a sprite to an object or when you want to use a font in Drag and Drop or in any number of situations, you will be presented with the Asset Explorer:
zh_cn: 当你希望为一个物体添加精灵或者在拖拽按钮（Drag and Drop）中选用一个字体又或者是其他许多场合下，资产浏览器总会呈现到你的眼前：

source: When you release the mouse button, an instance of that object will have been added to the room.
zh_cn: 当您释放鼠标按钮时，该物体的一个实例将被添加到房间。

source: When you restart the program and log back in again the new licence should be applied correctly.
zh_cn: 当您重启程序并重新登录时，新的许可将会被应用.

source: When you run a game on a target that requires the Micro Web Server you will get a new window opening as the game is served to the chosen device:
zh_cn: 当你在需要使用微型网络服务器的目标上运行游戏的时候，你会看到当游戏在所选设备上被伺服时会打开一个新的窗口：

source: When you run your game, this surface is created the first time that the draw event is called in each new room that you enter, which means that nothing is drawn until that point.
zh_cn: 当你运行游戏时，在进入每个新房间调用绘制事件的第一时间会创建这个表面， 这意味着在那之前什么都不会绘制。

source: When you select Search and Replace from the Edit menu, it will open the following window:
zh_cn: 当你在 编辑 菜单中选择 查找和替换 时，会打开如下窗口：

source: When you try to use the debugger on the YYC target, you will get a warning informing you of this, and the fact that the project will be compiled using the VM instead.
zh_cn: 当你试图在YYC目标上使用调试器时，你将得到一个警告，告知你这一点，并且项目将会采用VM进行编译。

source: When you use this window to make a search, the results will be shown in the Search Output Window.
zh_cn: 当您使用此窗口进行搜索时，结果将显示在 搜索输出窗口 中。

source: When you want to draw text in your game this text will be drawn in a standard Arial 12 points font by default, but to make more interesting or unique looking texts you will probably want to use different fonts.
zh_cn: 当你在游戏中绘制文本时，默认情况下该文本以标准 Arial 12 号字体绘制。

source: Where
zh_cn: 位置

source: Where the GUI is positioned (ie: the (0,0) position) will depend on whether you have used the function display_set_gui_maximise() or not.
zh_cn: GUI放置的位置 (比如 (0,0)位置)取决于你是否使用这个函数 display_set_gui_maximise() 。

source: Whether to set the screen to fullscreen (true) or not (false).
zh_cn: 设置屏幕为全屏（true）或不是（false）。

source: Whether we should reset back to 1:1 when moving between windows using the keyboard shortcuts
zh_cn: 使用快捷键在窗口间移动时，我们是否应该重置回1:1

source: While GameMaker Studio 2 is a powerful tool, it cannot do everything for you at the touch of a button so start small with simple examples and you will realize that not only is creating games great fun, but that learning to use GameMaker Studio 2 to do it is also very rewarding!
zh_cn: 而 GameMaker Studio 2是一个强大的工具，在能随心所欲的制作游戏之前，我们先从一些简单的小例子开始。你就会明白，制作游戏是一件很有趣的事情， 而且学习使用 GameMaker Studio 2 也是非常值得的！

source: While Loop
zh_cn: 当型循环（While）

source: While it's true you can still get some speed ups - and sometimes these can be significant - using binary and hex leads to you knowing the CPU better and can also lead to writing better code, being able to pack data better, and making some tasks a lot simpler.
zh_cn: 虽然这是事实，你仍然可以得到一些速度上的提升 - 而有时这些提升可以更加显著 - 使用二进制和十六进制可以让 CPU 运行得更快，也能写出更好的代码，以及更好的打包数据，让一些任务变得简单得多，这些你应该都是知道的。

source: While we finish up your installation...
zh_cn: 当我们完成您的安装时...

source: While within any workspace you can call up the Right Button Menu at any time by right-clicking anywhere, which will open the following menu:
zh_cn: 在任何工作区内，您可以随时在任何地方通过右键单击 调用 右键菜单，菜单内容如下：

source: White Space
zh_cn: 空白区域

source: White space text style
zh_cn: 空白区文本样式(?)

source: Whole Word
zh_cn: 全词匹配

source: Whole Word Only
zh_cn: 全词匹配

source: Why would you use this?
zh_cn: 你为什么需要用这个？

source: Why?
zh_cn: 为什么？

source: Wide Back Flip Image
zh_cn: 向后翻转的宽幅图片

source: Wide Cycle Image 1
zh_cn: 宽的循环图片 1

source: Wide Cycle Image 2
zh_cn: 宽的循环图片 2

source: Wide Cycle Image 3
zh_cn: 宽的循环图片 3

source: Wide Cycle Image 4
zh_cn: 宽的循环图片 4

source: Wide Cycle Image 5
zh_cn: 宽的循环图片 5

source: Wide Cycle Image 6
zh_cn: 宽的循环图片 6

source: Wide Cycle Image 7
zh_cn: 宽的循环图片 7

source: Wide Cycle Image 8
zh_cn: 宽的循环图片 8

source: Wide Cycle Image 9
zh_cn: 宽的循环图片 9

source: Wide Front Flip Image
zh_cn: 向前翻转的宽幅图片

source: Wide Iconic
zh_cn: 宽图标型

source: Wide Image
zh_cn: 宽图片

source: Wide Logo
zh_cn: 宽Logo

source: Width
zh_cn: 宽度

source: Width:
zh_cn: 宽：

source: Wiggle
zh_cn: 摆动

source: Win UWP Tools Folder
zh_cn: Win UWP 工具文件夹

source: Win UWP Tools location
zh_cn: Win UWP Tools 位置

source: Window
zh_cn: 窗口

source: Window Frame
zh_cn: 窗口框架

source: Window Resize
zh_cn: 窗口大小调整

source: Windowing
zh_cn: 视窗化

source: Windows 10 Desktop
zh_cn: Windows 10 桌面版

source: Windows 10 Mobile
zh_cn: Windows 10 移动版

source: Windows 32 only
zh_cn: 仅用于32位的Windows系统

source: Windows 8 (Native only), Windows 10 and Windows Phone
zh_cn: Windows 8 (仅Native)，Windows 10 及 Windows Phone

source: Windows Menu
zh_cn: 窗口菜单

source: Windows NSIS Installer Script has been set to default due to changes in GameMaker Studio 2
zh_cn: 由于 GameMaker Studio 2 中的更改，Windows NSIS 安装程序脚本已设置为默认值

source: Windows Target Platform Min Version
zh_cn: Windows目标平台最小版本

source: Windows Target Platform Version
zh_cn: Windows 目标平台版本

source: With a sprite assigned to the object you can click the Edit Sprite button to change the sprite properties, or if you do not have a sprite for the object but wish to create one you can click the Add Sprite button to create a new sprite resource and assign that.
zh_cn: 使用分配给物体的精灵，您可以单击编辑Sprite按钮来更改精灵属性，或者如果您没有该对象的精灵，但希望创建一个，可以单击添加Sprite按钮到创建一个新的精灵资源并进行分配。

source: With a sprite created, we can go ahead and define the tile set, which means you have to first create a new tile set resource by right clicking the Tile Set resource folder and selecting Create.
zh_cn: 创建一个精灵后，我们可以继续来定义图块集，您需要先通过右键单击 图块集资源文件夹并选择 创建 来创建新的图块集资源。

source: With that done how do we use an array for practical things?
zh_cn: 然后，我们怎么实际应用呢？

source: With that done, everything that would appear in view 0 will now be drawn to the surface we have created instead.
zh_cn: 之后，所以将出现在视野view 0中的事物现在绘制到我们创建的表面层里。.

source: With the "normal" collision system your collisions are based off of the mask of the sprite assigned to the object, but with physics enabled this is no longer the case.
zh_cn: 使用“正常”碰撞系统，您的碰撞是基于分配给对象的精灵的掩码，但是物理启用不再是这样。

source: With the Amazon Fire version of GameMaker Studio 2 all the limitations of the Trial Licence (see above) are removed and you can compile projects to the Amazon Fire target.
zh_cn: 对于 Amazon Fire 版本 GameMaker Studio 2，所有试用版的限制将会解除（如上），你可以编译到 Amazon Fire 目标平台。

source: With the Consoles version of GameMaker Studio 2 all the limitations of the Trial Licence (see above) are removed and you can compile projects for the following target platforms
zh_cn: 对于GMS2的 控制台 版本，所有试用版的限制（如上）都将解除，你可以为以下目标平台编译项目：

source: With the Creator version of GameMaker Studio 2 most of the limitations of the Trial Licence (see above) are removed except the ability to change the Splash Screen, the ability to disable anonymous IDE statistics and the ability to use the YYC target.
zh_cn: 使用 创造者（Creator） 版本的 GameMaker Studio 2，除了启动界面、禁用匿名IDE统计和使用YYC编译之外，大多数试用版许可的限制 (参见上文)将被移除。

source: With the Desktop version of GameMaker Studio 2 all the limitations of the Trial Licence (see above) are removed and you can compile projects to the following Desktop targets:
zh_cn: 对于GMS2的桌面版，试用版的所有限制（如上）都被解除了，你可以编译到如下的桌面目标平台：

source: With the Mobile version of GameMaker Studio 2 all the limitations of the Trial Licence (see above) are removed and you can compile projects to the following targets:
zh_cn: 对于GMS2的移动端版本，所有试用版的限制都将解除（如上），你可以编译项目到下面的目标平台：

source: With the UWP version of GameMaker Studio 2 all the limitations of the Trial Licence (see above) are removed and you can compile projects as UWP compliant executables.
zh_cn: 对于GMS2 的UWP版本，所有试用版的限制（如上）将被解除，你可以将项目编译为UWP兼容的可执行文件。

source: With the Web version of GameMaker Studio 2 all the limitations of the Trial Licence (see above) are removed and you can compile projects to the HTML5 target.
zh_cn: 对于GMS2的 网页版本，所用试用版的限制将会解除（如上），你可以编译到HTML5目标平台。

source: With the advent of vertex buffers, matrices and cameras in GameMaker Studio 2, the following functions have been made obsolete:
zh_cn: 随着GameMaker Studio 2中顶点缓冲区、矩阵以及摄像机系统的引进，下述函数已经作废：

source: With the resources you have seen so far you can add some nice images and sounds to the game resource tree, but they don't do anything in the game itself yet!
zh_cn: 到目前为止你可以添加漂亮的图像和优美的声音资源，但是它们还没有在游戏内做任何事！

source: With these tools you can see how well your game is performing and what areas need "tweaked" to increase this performance.
zh_cn: 使用这些工具，您可以看到游戏的表现如何，以及需要“调整”哪些方面才能提高游戏的性能。

source: With this function you can center the game window in the display when the target module is Windows, Ubuntu (Linux) or MacOS, or you can center it in the browser if the target module is HTML5.
zh_cn: 对于Windows, Ubuntu (Linux) 或者 MacOS 平台， 你可以使用这个函数将游戏窗口屏幕居中，而对于HTML5目标模块，是浏览器居中。

source: With this function you can change or set the position of the mouse within the game display which can be useful for FPS games, for example.
zh_cn: 有了这个函数，你便可以更改或设置游戏屏幕上的鼠标位置，对于FPS游戏来说，这可能会比较好用。
